                                                                                                                                                                            
-- --------------------------------------Задание 1 --------------------------------------

select id,name from users where id in(select user_id from orders);

-- ---------------------------------------------------------------------------------------    

-- --------------------------------------Задание 2 ---------------------------------------    

select p.name as 'Название продукта', c.name as 'Каталог интернет-магазина'
	from
		products as p
    join
		catalogs as c
	on p.catalog_id = c.id
	WHERE
  c.id = (select id from catalogs where name = 'Материнские платы');
-- ---------------------------------------------------------------------------------------     
 
-- --------------------------------------Задание 3 ---------------------------------------   
select dep.name as ' Отправление', dest.name as 'Прибытие'
	from
		flights 
    join
		cities  as dep
	on flights.`from` = dep.label
	join
		cities  as dest
	on flights.`to` = dest.label;
-- ---------------------------------------------------------------------------------------     
 

